src/cf/InformationRegisters/МП_ПротоколРаботыПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>МП_ПротоколРаботыПользователей</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторОбъекта</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСобытийПротоколаРаботыСМобильнымКлиентом</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПользовательМобильногоПриложения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПользователиМобильногоПриложения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МоментВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ТипыСобытийПротоколаРаботыСМобильнымКлиентом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыСобытийПротоколаРаботыСМобильнымКлиентом</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Информация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предупреждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеОПроблемеОтПользователя</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/МП_ПротоколРаботыПользователей/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Добавляет запись в протокол
// Параметры
//	ПользовательМобильногоПриложения - СправочникСсылка - Ссылка на пользователя моб. приложения
//	МоментВремени - момент наступлени события в миллисекундах
//	Период - дата наступления события
//	ИдентификаторОбъекта - уникальный идентификатор объекта, с которым связано произошедшее событие
//	ОписаниеСобытия - текстовое описание события
//	ТипОбъекта - имя типа объекта, с которым связано событие
//	ТиСобытия - значение перечисления ТипыСобытийПротоколаРаботыСМобильнымКлиентом
Процедура ДобавитьЗаписьВПротоколСКлиента(
	ПользовательМобильногоПриложения,
	МоментВремени,
	Период,
	ИдентификаторОбъекта,
	ОписаниеСобытия,
	ТипОбъекта,
	ТипСобытия) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписиРегистра = СоздатьМенеджерЗаписи();
	МенеджерЗаписиРегистра.ПользовательМобильногоПриложения = ПользовательМобильногоПриложения;
	МенеджерЗаписиРегистра.МоментВремени = МоментВремени;
	МенеджерЗаписиРегистра.Период = Период;
		
	МенеджерЗаписиРегистра.ИдентификаторОбъекта = ИдентификаторОбъекта;
	МенеджерЗаписиРегистра.ОписаниеСобытия = ОписаниеСобытия;
	МенеджерЗаписиРегистра.СКлиента = Истина;
	МенеджерЗаписиРегистра.ТипОбъекта = ТипОбъекта;
	МенеджерЗаписиРегистра.ТипСобытия = ТипСобытия;
	
	МенеджерЗаписиРегистра.Записать();
	
КонецПроцедуры

// Добавляет запись об ошибке, связанную с объектом данных
// Параметры:
//	Сообщение - описание ошибки
//	ТипОбъекта - имя типа объекта
//	ИдентификаторОбъекта - уникальный идентификатор объекта
//	СКлиента - флаг, показывающий, где произошло событие: на мобильном клиенте или не сервере
//	МобильныйКлиент - ссылка на узел плана обмена Мобильный
Процедура ДобавитьОшибкуПоОбъекту(Сообщение, ТипОбъекта, ИдентификаторОбъекта, СКлиента, МобильныйКлиент) Экспорт
	
	ДобавитьЗаписьВПротокол(
		Перечисления.ТипыСобытийПротоколаРаботыСМобильнымКлиентом.Ошибка,
		Сообщение,
		ТипОбъекта,
		ИдентификаторОбъекта,
		СКлиента,
		МобильныйКлиент);
	
КонецПроцедуры

// Добавляет информационную запись о событии, связанным с объектом данных
// Параметры:
//	Сообщение - описание события
//	ТипОбъекта - имя типа объекта
//	ИдентификаторОбъекта - уникальный идентификатор объекта
//	СКлиента - флаг, показывающий, где произошло событие: на мобильном клиенте или не сервере
//	МобильныйКлиент - ссылка на узел плана обмена Мобильный 
Процедура ДобавитьИнформациюПоОбъекту(Сообщение, ТипОбъекта, ИдентификаторОбъекта, СКлиента, МобильныйКлиент) Экспорт
	
	ДобавитьЗаписьВПротокол(
		Перечисления.ТипыСобытийПротоколаРаботыСМобильнымКлиентом.Информация,
		Сообщение,
		ТипОбъекта,
		ИдентификаторОбъекта,
		СКлиента,
		МобильныйКлиент);
	
КонецПроцедуры

// Добавляет информационную запись о событии
// Параметры:
//	Сообщение - описание события
//	СКлиента - флаг, показывающий, где произошло событие: на мобильном клиенте или не сервере
//	МобильныйКлиент - ссылка на узел плана обмена Мобильный 
Процедура ДобавитьИнформацию(Сообщение, СКлиента, МобильныйКлиент) Экспорт
	
	ДобавитьЗаписьВПротокол(
		Перечисления.ТипыСобытийПротоколаРаботыСМобильнымКлиентом.Информация,
		Сообщение,
		,
		,
		СКлиента,
		МобильныйКлиент);
	
КонецПроцедуры

// Добавляет запись об ошибке
// Параметры:
//	Сообщение - описание ошибки
//	СКлиента - флаг, показывающий, где произошло событие: на мобильном клиенте или не сервере
//	МобильныйКлиент - ссылка на узел плана обмена Мобильный 
Процедура ДобавитьОшибку(Сообщение, СКлиента, МобильныйКлиент) Экспорт
	
	ДобавитьЗаписьВПротокол(
		Перечисления.ТипыСобытийПротоколаРаботыСМобильнымКлиентом.Ошибка,
		Сообщение,
		,
		,
		СКлиента,
		МобильныйКлиент);
	
КонецПроцедуры

// Добавляет предупреждение
// Параметры:
//	Сообщение - описание предупреждения
//	СКлиента - флаг, показывающий, где произошло событие: на мобильном клиенте или не сервере
//	МобильныйКлиент - ссылка на узел плана обмена Мобильный 
Процедура ДобавитьПредупреждение(Сообщение, СКлиента, МобильныйКлиент) Экспорт
	
	 ДобавитьЗаписьВПротокол(
		Перечисления.ТипыСобытийПротоколаРаботыСМобильнымКлиентом.Предупреждение,
		Сообщение,
		,
		,
		СКлиента,
		МобильныйКлиент);
	
КонецПроцедуры

// Добавляет запись с сообщением о проблеме, поступившим от пользователя
// Параметры:
//	Сообщение - описание предупреждения
//	СКлиента - флаг, показывающий, где произошло событие: на мобильном клиенте или не сервере
//	МобильныйКлиент - ссылка на узел плана обмена Мобильный 
Процедура ДобавитьСообщениеОПроблемеОтПользователя(Сообщение, СКлиента, МобильныйКлиент) Экспорт
	
	 ДобавитьЗаписьВПротокол(
		Перечисления.ТипыСобытийПротоколаРаботыСМобильнымКлиентом.СообщениеОПроблемеОтПользователя,
		Сообщение,
		,
		,
		СКлиента,
		МобильныйКлиент);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ДобавитьЗаписьВПротокол(
	ТипСобытия = Неопределено,
	Описание,
	ТипОбъекта = "",
	ИдентификаторОбъекта = Неопределено,
	СКлиента,
	ПользовательМобильногоПриложения)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипСобытия = Неопределено Тогда
		ТипСобытия = Перечисления.ТипыСобытийПротоколаРаботыСМобильнымКлиентом.Информация;
	КонецЕсли;
	
	Если ИдентификаторОбъекта = Неопределено Тогда
		ИдентификаторОбъекта = УникальныйИдентификаторПустой();
	КонецЕсли;
	
	МенеджерЗаписиРегистра = СоздатьМенеджерЗаписи();
	МенеджерЗаписиРегистра.ПользовательМобильногоПриложения = ПользовательМобильногоПриложения;
	МенеджерЗаписиРегистра.МоментВремени = ТекущаяУниверсальнаяДатаВМиллисекундах();
	МенеджерЗаписиРегистра.Период = ТекущаяДатаСеанса();
		
	МенеджерЗаписиРегистра.ИдентификаторОбъекта = ИдентификаторОбъекта;
	МенеджерЗаписиРегистра.ОписаниеСобытия = Описание;
	МенеджерЗаписиРегистра.СКлиента = СКлиента;
	МенеджерЗаписиРегистра.ТипОбъекта = ТипОбъекта;
	МенеджерЗаписиРегистра.ТипСобытия = ТипСобытия;
	
	МенеджерЗаписиРегистра.Записать();
	
КонецПроцедуры

#КонецЕсли
